In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("community_health.csv")

In [3]:
df.rename(columns={
    "age" : "yas",
    "gender" : "cinsiyet",
    "race/ethnicity" : "irk",
    "weight" : "kilo",
    "height" : "boy",
    "visits" : "hastane ziyaret"
}, inplace= True)
df.head(2)

   yas cinsiyet      irk  kilo  boy  hastane ziyaret
0   47   female  group D   247   65               28
1   26     male  group C   283   66               23

In [4]:
df["cinsiyet"].replace({
    "female" : 0,
    "male" : 1
}, inplace=True)
df.head(2)

   yas  cinsiyet      irk  kilo  boy  hastane ziyaret
0   47         0  group D   247   65               28
1   26         1  group C   283   66               23

In [5]:
df["irk"].replace({
    "group A" : 1,
    "group B" : 2,
    "group C" : 3,
    "group D" : 4,
    "group E" : 5,
    
}, inplace=True)
df.head(2)

   yas  cinsiyet  irk  kilo  boy  hastane ziyaret
0   47         0    4   247   65               28
1   26         1    3   283   66               23

In [6]:
df["kilo"] = round(df["kilo"]*0.453592)
df["boy"] = round(df["boy"]*2.54)
df.head()

   yas  cinsiyet  irk   kilo    boy  hastane ziyaret
0   47         0    4  112.0  165.0               28
1   26         1    3  128.0  168.0               23
2   26         1    2   91.0  173.0               14
3   39         1    3  108.0  185.0               21
4   55         1    1   90.0  155.0               27

In [7]:
df["VKİ"] = round(df["kilo"]/((df["boy"]/100)**2),2)
df.drop(["kilo","boy"], inplace=True, axis=1)
df.head(10)

   yas  cinsiyet  irk  hastane ziyaret    VKİ
0   47         0    4               28  41.14
1   26         1    3               23  45.35
2   26         1    2               14  30.41
3   39         1    3               21  31.56
4   55         1    1               27  37.46
5   46         0    4               16  17.31
6   40         1    4               28  42.37
7   52         1    2               21  36.15
8   49         1    1               19  19.88
9   27         0    1                9  20.15

In [8]:
X = df.drop("hastane ziyaret", axis=1)
X.head()

   yas  cinsiyet  irk    VKİ
0   47         0    4  41.14
1   26         1    3  45.35
2   26         1    2  30.41
3   39         1    3  31.56
4   55         1    1  37.46

In [9]:
y = df["hastane ziyaret"]
y.head()

0    28
1    23
2    14
3    21
4    27
Name: hastane ziyaret, dtype: int64

In [10]:
from sklearn.model_selection import train_test_split

In [11]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=66)

In [12]:
from sklearn.linear_model import LinearRegression

In [13]:
regr = LinearRegression()
regr.fit(X_train, y_train)

LinearRegression()

In [14]:
test_preds = regr.predict(X_test)

In [15]:
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score

In [16]:
print("R^2 :       ", round(r2_score(y_test,test_preds),2))
print("MAE :       ", round(mean_absolute_error(y_test,test_preds),2))
print("RMSE :      ", round(np.sqrt(mean_squared_error(y_test,test_preds)),2))

R^2 :        0.86
MAE :        2.09
RMSE :       2.45

In [17]:
regr.fit(X,y)
y_hat = regr.predict(X)

In [18]:
print("R^2 :       ", round(r2_score(y,y_hat),2))
print("MAE :       ", round(mean_absolute_error(y,y_hat),2))
print("RMSE :      ", round(np.sqrt(mean_squared_error(y,y_hat)),2))

R^2 :        0.85
MAE :        2.15
RMSE :       2.51

In [19]:
coef_df = pd.DataFrame(regr.coef_, X.columns,columns=["Katsayi"])
coef_df

           Katsayi
yas       0.247916
cinsiyet  0.199738
irk       0.030077
VKİ       0.493233

In [20]:
from joblib import dump, load
dump(regr, "dr_visit_1.joblib")
model_yukle = load("dr_visit_1.joblib")

In [21]:
insan = [[25,0,3,24]]
model_yukle.predict(insan)

c:\Users\alpay\AppData\Local\Programs\Python\Python37\lib\site-packages\sklearn\base.py:451: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"

array([11.18301707])